<a href="https://colab.research.google.com/github/tinhb92/relax_ml/blob/master/sql.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

In [1]:
! pip install -U pandasql

Collecting pandasql
  Downloading https://files.pythonhosted.org/packages/6b/c4/ee4096ffa2eeeca0c749b26f0371bd26aa5c8b611c43de99a4f86d3de0a7/pandasql-0.7.3.tar.gz
Requirement already satisfied, skipping upgrade: numpy in /usr/local/lib/python3.6/dist-packages (from pandasql) (1.16.5)
Requirement already satisfied, skipping upgrade: pandas in /usr/local/lib/python3.6/dist-packages (from pandasql) (0.24.2)
Requirement already satisfied, skipping upgrade: sqlalchemy in /usr/local/lib/python3.6/dist-packages (from pandasql) (1.3.8)
Requirement already satisfied, skipping upgrade: python-dateutil>=2.5.0 in /usr/local/lib/python3.6/dist-packages (from pandas->pandasql) (2.5.3)
Requirement already satisfied, skipping upgrade: pytz>=2011k in /usr/local/lib/python3.6/dist-packages (from pandas->pandasql) (2018.9)
Requirement already satisfied, skipping upgrade: six>=1.5 in /usr/local/lib/python3.6/dist-packages (from python-dateutil>=2.5.0->pandas->pandasql) (1.12.0)
Building wheels for collected packages: pandasql
  Building wheel for pandasql (setup.py) ... done
  Created wheel for pandasql: filename=pandasql-0.7.3-cp36-none-any.whl size=26820 sha256=127257a7aa80046c811229b5ede0a60081a186426d1299c3073b4b038a26888f
  Stored in directory: /root/.cache/pip/wheels/53/6c/18/b87a2e5fa8a82e9c026311de56210b8d1c01846e18a9607fc9
Successfully built pandasql
Installing collected packages: pandasql
Successfully installed pandasql-0.7.3

In [0]:
from pandasql import sqldf, load_meat, load_births

In [0]:
pysqldf = lambda q: sqldf(q, globals())

In [0]:
meat = load_meat()

In [5]:
meat.head()

        date   beef   veal  ...  broilers  other_chicken  turkey
0 1944-01-01  751.0   85.0  ...       NaN            NaN     NaN
1 1944-02-01  713.0   77.0  ...       NaN            NaN     NaN
2 1944-03-01  741.0   90.0  ...       NaN            NaN     NaN
3 1944-04-01  650.0   89.0  ...       NaN            NaN     NaN
4 1944-05-01  681.0  106.0  ...       NaN            NaN     NaN

[5 rows x 8 columns]

In [0]:
births = load_births()

In [7]:
births.head()

        date  births
0 1975-01-01  265775
1 1975-02-01  241045
2 1975-03-01  268849
3 1975-04-01  247455
4 1975-05-01  254545

In [8]:
meat.shape

(827, 8)

In [11]:
meat.query('beef>751').head()

         date   beef   veal  ...  broilers  other_chicken  turkey
7  1944-08-01  787.0  175.0  ...       NaN            NaN     NaN
8  1944-09-01  774.0  182.0  ...       NaN            NaN     NaN
9  1944-10-01  834.0  215.0  ...       NaN            NaN     NaN
10 1944-11-01  786.0  197.0  ...       NaN            NaN     NaN
11 1944-12-01  764.0  146.0  ...       NaN            NaN     NaN

[5 rows x 8 columns]

In [10]:
pysqldf("SELECT * FROM meat LIMIT 10").head()

                         date   beef   veal  ...  broilers  other_chicken turkey
0  1944-01-01 00:00:00.000000  751.0   85.0  ...      None           None   None
1  1944-02-01 00:00:00.000000  713.0   77.0  ...      None           None   None
2  1944-03-01 00:00:00.000000  741.0   90.0  ...      None           None   None
3  1944-04-01 00:00:00.000000  650.0   89.0  ...      None           None   None
4  1944-05-01 00:00:00.000000  681.0  106.0  ...      None           None   None

[5 rows x 8 columns]

In [12]:
pysqldf("SELECT beef FROM meat WHERE beef>751").head()

    beef
0  787.0
1  774.0
2  834.0
3  786.0
4  764.0

In [13]:
pysqldf("SELECT SUM(CASE When beef>751 Then 1 Else 0 End ) as sum_beef FROM meat;").head()

   sum_beef
0       783

In [14]:
pysqldf("SELECT SUM(CASE When beef>751 Then beef Else 0 End ) as sum_beef FROM meat;").head()

    sum_beef
0  1361964.2

In [15]:
pysqldf("SELECT * FROM meat ORDER BY beef").head()

                         date   beef  veal  ...  broilers  other_chicken  turkey
0  1946-09-01 00:00:00.000000  366.0  98.0  ...       NaN            NaN     NaN
1  1946-06-01 00:00:00.000000  461.0  78.0  ...       NaN            NaN     NaN
2  1951-06-01 00:00:00.000000  591.0  78.0  ...       NaN            NaN     NaN
3  1946-05-01 00:00:00.000000  605.0  83.0  ...       NaN            NaN     NaN
4  1944-04-01 00:00:00.000000  650.0  89.0  ...       NaN            NaN     NaN

[5 rows x 8 columns]

In [0]:
q = """SELECT
        m.date, m.beef, b.births
     FROM
        meats m
     INNER JOIN
        births b
           ON m.date = b.date;"""

In [0]:
joined = pysqldf(q)

In [0]:
q = """select
           strftime('%Y', date) as year
           , SUM(beef) as beef_total
           FROM
              meat
           GROUP BY
              year;"""

In [0]:
pysqldf(q).head()

   year  beef_total
0  1944      8801.0
1  1945      9936.0
2  1946      9010.0
3  1947     10096.0
4  1948      8766.0

In [16]:
!pip install pydbgen

Collecting pydbgen
  Downloading https://files.pythonhosted.org/packages/0d/4b/3b9e324838d4640a0b5eb9e452a6af6876625a6343c065ef0323921955b7/pydbgen-1.0.5-py3-none-any.whl (81kB)
     |████████████████████████████████| 81kB 9.2MB/s
Collecting Faker (from pydbgen)
  Downloading https://files.pythonhosted.org/packages/bf/5a/44c04abc182990d716eb7703502aa851433ea66569bd72765ef1abdaea9c/Faker-2.0.2-py2.py3-none-any.whl (879kB)
     |████████████████████████████████| 880kB 27.6MB/s
Requirement already satisfied: six in /usr/local/lib/python3.6/dist-packages (from pydbgen) (1.12.0)
Requirement already satisfied: Pandas in /usr/local/lib/python3.6/dist-packages (from pydbgen) (0.24.2)
Collecting text-unidecode==1.3 (from Faker->pydbgen)
  Downloading https://files.pythonhosted.org/packages/a6/a5/c0b6468d3824fe3fde30dbb5e1f687b291608f9473681bbf7dabbf5a87d7/text_unidecode-1.3-py2.py3-none-any.whl (78kB)
     |████████████████████████████████| 81kB 28.6MB/s
Requirement already satisfied: python-dateutil>=2.4 in /usr/local/lib/python3.6/dist-packages (from Faker->pydbgen) (2.5.3)
Requirement already satisfied: numpy>=1.12.0 in /usr/local/lib/python3.6/dist-packages (from Pandas->pydbgen) (1.16.5)
Requirement already satisfied: pytz>=2011k in /usr/local/lib/python3.6/dist-packages (from Pandas->pydbgen) (2018.9)
ERROR: python-slugify 3.0.3 has requirement text-unidecode==1.2, but you'll have text-unidecode 1.3 which is incompatible.
Installing collected packages: text-unidecode, Faker, pydbgen
  Found existing installation: text-unidecode 1.2
    Uninstalling text-unidecode-1.2:
      Successfully uninstalled text-unidecode-1.2
Successfully installed Faker-2.0.2 pydbgen-1.0.5 text-unidecode-1.3

In [0]:
import pydbgen
from pydbgen import pydbgen
myDB=pydbgen.pydb()

In [0]:
myDB.gen_dataframe??

In [0]:
df0=myDB.gen_dataframe(20,['name','city','phone'], seed = 8)

In [0]:
df0['id'] = range(20)

In [33]:
df0.head()

              name              city  phone-number  id
0  Elizabeth Green            Slagle  318-353-4420   0
1  Kimberly Romero     Stony Prairie  831-762-0535   1
2   Edward Hawkins      Sioux Center  263-489-3560   2
3      Julie Walsh  Johnsons Station  839-254-9850   3
4    Michael Smith            Mentor  580-432-8850   4

In [31]:
df1=myDB.gen_dataframe(20,['company','country','city'])
df1['id'] = range(20)
df1.head()

                    company             country          city  id
0                Jordan LLC    Christmas Island      Hineston   0
1           Marshall-Greene          Tajikistan  Flower Mound   1
2           Robertson Group              Norway    Ferrelview   2
3          Simpson and Sons  Russian Federation     Kent City   3
4  Ortiz, Marshall and Bell           Swaziland        Denton   4

In [0]:
testdf=myDB.gen_dataframe(20,['name','city','phone','date'])

Multiple table; synthetic data for practice

In [0]:
q = """
SELECT * FROM df0 
INNER JOIN df1 
ON df0.id=df1.id
"""

Use the result as one table, nested

In [0]:
q = """
SELECT name FROM 
(SELECT * FROM df0 
INNER JOIN df1 
ON df0.id=df1.id) a
"""

In [0]:
q = """
SELECT a.name FROM 
(SELECT * FROM df0 
INNER JOIN df1 
ON df0.id=df1.id) a
"""

In [0]:
pysqldf(q).head()

              name
0  Elizabeth Green
1  Kimberly Romero
2   Edward Hawkins
3      Julie Walsh
4    Michael Smith

Inner join 2 nested